package day0808;

/**
 * 대입연산자 <br>
 * =<br>
 * +=, -=, *=, /=, %=<br>
 * <<=, >>=, >>>=
 * &=, |=, ^= 
 */
public class Operator7 {

	public static void main(String[] args) {
		int i=8;
		i=6;
		
		i+=2; //i = i + 2;
		i-=3; //i = i - 3;
		i*=2; //i = i * 2;
		i/=3; //i = i / 4;  // 정수 나누기 정수 = 정수. 3.14이런것도 3으로 내줌.
		System.out.println( i );
		i%=2; //i = i % 2;
//		double d=8;  //실수 나누기 정수 -> 실수
//		d /= 3;
		
		//쉬프트대입
		i = 6;
		i <<= 3; // i = i << 3; // 0000 0110 << 3 = 000 0011 0000 -> 48
		i >>= 2;//  i = i >> 2; // 0011 0000 >> 2 = 0000 1100  00 -> 12
		i >>>= 1; // i = i >>> 1; 0000 1100 >>> 1 = 0000 01100  0 -> 6
		
		//비트논리 대입
		i &= 12; // 0000 0110 & 0000 1100 => 0000 0100 ->4
		i |= 9; // i = i | 9; 0000 0100 | 0000 1001 -> 0000 1101 ->13
		i ^= 10;//  i = i ^ 10; 0000 1101 ^ 0000 1010 -> 0000 0111 -> 7 
		
		double d=0.0D;
		//d=8/3; //자바는 정수 나누기 정수 하면 정수로 나와서 값이 2.0임. 2.666할려면 값 하나를 실수로
		d=8.0/3;
		
		System.out.println( i );
		System.out.println( d );
		
	}//main

}//class
