package day0820;

/**
 * 문제
 * 1. "test@test.com, kim@sist.co.kr, lee12@naver.com, parktest.com, kim123@com, test1234@gmail.com"
 * CSV데이터를 배열로 만들고 2번 method에 배열 값을 넣어서 반환되는 메시지를 console에 출력 
 * 
 * 2. 이메일의 유효성 검증하여 결과를 문자열로 반환하는 mehtod 작성
 * 유효성 - 글자수가 5자 이하면 -메일의 글자수가 충분하지 못합니다.
 * @ 없으면 -메일에 @이 없습니다.
 * . 없으면,- 메일에 .이 없습니다.
 * @.의 순서가 바뀌었다면 - @과 .의 순서가 맞지 않습니다.  
 * 
 * 모든 유효성을 만족하면 "유효한 메일"을 반환
 * 
 * 3. 1번 메일 주소에서 유효한
 *  메일 주소의 개수를 출력 -> 4개
 * 4. 유효한 메일중에 gTLD(.com 이런 도메인)의 개수를 출력 -> 3개
 */
public class Exem0820 {
	
}
